# Расчет суммы вида n + nn + nnn
"""
# 1. Вариант от новичка:
n = int(input('Ведите натуральное число n: '))
k = 0  # переменная для разрядности
z = n  # переменная для цикла определения разрядности
# определяем разрядность
while z > 0:
    z = z // 10
    k += 1
"""
# 2. Вариант - с len():
user_n = input('Ведите натуральное число n: ')
k = len(user_n)  # определяем разрядность
n = int(user_n)  # переводим в числовой формат
# находим сумму
s = 0  # начальная сумма разрядов
i = 0  # количество слагаемых
while i < 3:
    j = 0
    while j < (i + 1):
        c = k * j
        s = s + (10 ** c)
        j += 1
    i += 1
sm = n * s  # искомая сумма
print(f'Сумма вида "n + nn + nnn": {n}{n}{n} + {n}{n} + {n} = {sm}')
