# Определение месяца
user_month = int(input('Ведите номер месяца: '))
v = dict([(12, 'зима'), (1, 'зима'), (2, 'зима'), (3, 'весна'), (4, 'весна'), (5, 'весна'), (6, 'лето'), (7, 'лето'),
          (8, 'лето'), (9, 'осень'), (10, 'осень'), (11, 'осень')])
print(v.get(user_month))
''' 
# второй вариант
user_month = int(input('Ведите номер месяца: '))
v = dict.fromkeys([12, 1, 2], 'зима')
v.update(dict.fromkeys([3, 4, 5], 'весна'))
v.update(dict.fromkeys([6, 7, 8], 'лето'))
v.update(dict.fromkeys([9, 10, 11], 'осень'))
print(v)'''
