"""
Создать программный файл в текстовом формате, записать в него построчно данные,
вводимые пользователем. Об окончании ввода данных будет свидетельствовать пустая
строка.
"""
import os
with open(os.getcwd() + r'\task_5-1.txt', 'w+') as my_file:  # создаем файл программно в директории скрипта
    mass = ['begin', '']  # создаем список из перменных - флаг цикла и будущий список
    while mass[0] != 'stop':  # пока пользователь не пожелал завершить
        user_str = input("Введите строку, если хотите завершить - введите пустую строку: ")  # пользователь вводит строку
        mass = ['stop', ''] if user_str == '' else ['begin', user_str]  # в зависимости от введенных данных, меняем список переменных
        my_file.writelines(mass[1] + '\n')  # записываем данные в файл
# проверка:
    my_file.seek(0)  # пока файл открыт, переводим курсор в начало файла
    for line in my_file:
        print(line)  # печатаем кажду строку файла
