# Наибольшая цифра в числе
"""
# 1. Вариант от новичка, без len():
num = int(input('Ведите целое положительное число: '))
k = 0 # переменная для разрядности
z = n # переменная для цикла определения разрядности
# определяем разрядность
while z > 0:
    z = z // 10
    k += 1
"""
# 2. Вариант с len():
num = input('Ведите целое положительное число: ')
k = len(num)  # определяем разрядность
num = int(num)  # переводим в числовой формат
# ищем максимальную цифру
max_num = 0  # начальное значение максимальной цифры
i = 0  # переменная для цикла
while i < k:
    a = num % 10
    num = num // 10
    if max_num < a:
        max_num = a
    i += 1
print(f'В этом числе максимальной является цифра {max_num}')
