'''
Создать текстовый файл (не программно), сохранить в нём несколько строк, выполнить
подсчёт строк и слов в каждой строке.

Файл task_5-2.txt с содержимым:
"Файл для выполнения задания 5-2
это вторая строка
это третья строка"
'''

with open('task_5-2.txt', 'r') as my_file:
    words, str_line = 0, 0
    for line in my_file:
        words += line.count(" ", 0) + 1  # считаем и суммируем количество слов, разделенных пробелом
        str_line += 1  # считаем и суммируем количество строк в файле
print(f'В файле {"task_5-2.txt"}: строки - {str_line}, слова - {words}')
#  import os
# абсолютный путь к файлу:
# print(f'В файле {os.path.basename("C:/PyProjects/first/task5-2.txt")}: строки - {str_line}, слова - {words}')
